app/views/comments/_tweet_comments.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."tweet_id" = ?  [["tweet_id", 14]]
---
  <ul class="list-group list-group-flush" id="tweet-comments">
    <% if tweet.comments.size == 0 %>

SELECT "comments".* FROM "comments" WHERE "comments"."tweet_id" = ?  [["tweet_id", 14]]
---
    <% else %>
      <% tweet.comments.each do |comment| %>