app/views/comments/create.js.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."tweet_id" = ?  [["tweet_id", 14]]
---

$('#tweet-<%= @tweet.id %> .comment-icon').attr('data-original-title', "<%=  pluralize(@tweet.comments.size, 'comment') %>.");