app/views/tweets/_tweet.html.erb

        <% end %>
        <small id="like-number"><%= tweet.likes.size %></small>
---
SELECT "likes".* FROM "likes" WHERE "likes"."tweet_id" IN (?, ?, ?)  [["tweet_id", 6], ["tweet_id", 5], ["tweet_id", 4]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."tweet_id" = ?  [["tweet_id", 1]]

      <div class="d-flex flex-column align-items-center">
        <%= link_to "<i class='far fa-comment'></i>".html_safe, tweet_comments_path(tweet), {:remote => true, class: 'opacity-half comment-icon', data: { toggle: "tooltip", placement: "bottom", title: "#{pluralize(tweet.comments.size, "comment")}."}} %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."tweet_id" IN (?, ?, ?)  [["tweet_id", 6], ["tweet_id", 5], ["tweet_id", 4]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."tweet_id" = ?  [["tweet_id", 1]]