app/views/likes/_like_button.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."tweet_id" IN (?, ?)  [["tweet_id", 2], ["tweet_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."tweet_id" = ?  [["tweet_id", 2]]
---
<%= link_to "<i class='far fa-heart'></i>".html_safe, tweet_likes_path(tweet),  {:remote => true, method: :post, class: 'opacity-half', id: 'like-options', data: { toggle: "tooltip", placement: "bottom", title: "#{pluralize(tweet.likes.size, "like")}."}}  %>