app/helpers/application_helper.rb

SELECT  1 AS one FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."tweet_id" = ? AND "users"."id" = ? LIMIT ?  [["tweet_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def like?(tweet, user)
    tweet.liked_users.include?(user)

SELECT "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."user_id" = ?  [["user_id", 1]]
---
  def user_unread_messages(user)
    joins = user.user_rooms

    count = 0
    joins.each do |join|