app/controllers/comments_controller.rb

INSERT INTO "comments" ("text", "tweet_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "Thishs s "], ["tweet_id", 14], ["user_id", 5], ["created_at", "2020-08-04 23:42:16.236532"], ["updated_at", "2020-08-04 23:42:16.236532"]]
---
  def create
    @comment = Comment.new(comment_params)
    @tweet = @comment.tweet
    respond_to do |format|
      if @comment.save

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def set_tweet
    @tweet = Tweet.find(params[:tweet_id])