app/controllers/followings_controller.rb

INSERT INTO "followings" ("followed_id", "follower_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["followed_id", 1], ["follower_id", 2], ["created_at", "2020-07-31 20:09:58.846204"], ["updated_at", "2020-07-31 20:09:58.846204"]]
INSERT INTO "user_rooms" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["room_id", 49], ["created_at", "2020-07-31 20:09:58.596531"], ["updated_at", "2020-07-31 20:09:58.596531"]]
---
  def create
    following = Following.new(following_params)
    @user = following.followed
    @room_id = Room.create_room(@user, current_user)

    respond_to { |format| format.js { render :follow } } if following.save && @room_id