app/controllers/likes_controller.rb

  def create
    @like = Like.new(tweet: @tweet, user: current_user)
    respond_to { |format| format.js } if @tweet && @like.save
---
INSERT INTO "likes" ("tweet_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tweet_id", 1], ["user_id", 1], ["created_at", "2020-07-31 20:55:25.664521"], ["updated_at", "2020-07-31 20:55:25.664521"]]

  def set_tweet
    @tweet = Tweet.find(params[:tweet_id])
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]