app/controllers/messages_controller.rb

UPDATE "rooms" SET "last_message" = ?, "updated_at" = ? WHERE "rooms"."id" = ?  [["last_message", "2020-07-31 20:56:34.624869"], ["updated_at", "2020-07-31 20:56:34.627483"], ["id", 1]]
UPDATE "user_rooms" SET "unread_messages" = ?, "updated_at" = ? WHERE "user_rooms"."id" = ?  [["unread_messages", 0], ["updated_at", "2020-07-31 20:57:57.749669"], ["id", 1]]
UPDATE "user_rooms" SET "unread_messages" = ?, "updated_at" = ? WHERE "user_rooms"."id" = ?  [["unread_messages", 1], ["updated_at", "2020-07-31 20:57:57.868627"], ["id", 2]]
UPDATE "user_rooms" SET "unread_messages" = ?, "updated_at" = ? WHERE "user_rooms"."id" = ?  [["unread_messages", 0], ["updated_at", "2020-07-31 20:58:20.744634"], ["id", 2]]
UPDATE "user_rooms" SET "unread_messages" = ?, "updated_at" = ? WHERE "user_rooms"."id" = ?  [["unread_messages", 1], ["updated_at", "2020-07-31 20:58:20.841652"], ["id", 1]]
INSERT INTO "messages" ("user_id", "room_id", "created_at", "updated_at", "body") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["room_id", 1], ["created_at", "2020-07-31 20:57:57.957695"], ["updated_at", "2020-07-31 20:57:57.957695"], ["body", "sdfsdf"]]
---
  def create
    new_message = Message.new(user: current_user, room_id: message_params[:room_id], body: message_params[:body])
    room = new_message.room
    room.update(last_message: Time.zone.now)

    first_user = room.user_rooms[0]
    last_user = room.user_rooms[1]

    if first_user.user_id == current_user.id
      first_user.update(unread_messages: 0)
      last_user.update(unread_messages: (last_user.unread_messages ? last_user.unread_messages + 1 : 1))
    else
      last_user.update(unread_messages: 0)
      first_user.update(unread_messages: (first_user.unread_messages ? first_user.unread_messages + 1 : 1))
    end

    return unless new_message.save