app/controllers/rooms_controller.rb

  def set_room
    @room = Room.includes(:messages).find_by_id(params[:id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = ?  [["room_id", 1]]

  def secure_room
    @room = nil if @room && !@room.users.include?(current_user)
---
SELECT  1 AS one FROM "users" INNER JOIN "user_rooms" ON "users"."id" = "user_rooms"."user_id" WHERE "user_rooms"."room_id" = ? AND "users"."id" = ? LIMIT ?  [["room_id", 1], ["id", 2], ["LIMIT", 1]]