app/controllers/tweets_controller.rb

  def create
    @tweet = Tweet.new(tweet_params)
    respond_to do |format|
      if @tweet.save
---
INSERT INTO "tweets" ("text", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "Hi\r\n"], ["author_id", 1], ["created_at", "2020-07-31 19:04:00.983278"], ["updated_at", "2020-07-31 19:04:00.983278"]]

  def update
    respond_to do |format|
      if @tweet.update(tweet_params)
---
UPDATE "tweets" SET "text" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["text", "jhfhkvlHi\r\n"], ["updated_at", "2020-07-31 21:08:43.849649"], ["id", 1]]