app/models/room.rb

  def self.create_room(first_user, second_user)
    rooms = Room.joins(user_rooms: :user).where(users: { id: first_user.id }) &
            Room.joins(user_rooms: :user).where(users: { id: second_user.id })
    if rooms.empty?
      room = Room.new
      room.save
      UserRoom.create(room: room, user: first_user)
      UserRoom.create(room: room, user: second_user)
---
SELECT "rooms".* FROM "rooms" INNER JOIN "user_rooms" ON "user_rooms"."room_id" = "rooms"."id" INNER JOIN "users" ON "users"."id" = "user_rooms"."user_id" WHERE "users"."id" = ?  [["id", 2]]
SELECT  1 AS one FROM "user_rooms" WHERE "user_rooms"."user_id" = ? AND "user_rooms"."room_id" = ? LIMIT ?  [["user_id", 1], ["room_id", 49], ["LIMIT", 1]]
INSERT INTO "rooms" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-07-31 19:46:56.384169"], ["updated_at", "2020-07-31 19:46:56.384169"]]
INSERT INTO "user_rooms" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["room_id", 49], ["created_at", "2020-07-31 20:09:58.596531"], ["updated_at", "2020-07-31 20:09:58.596531"]]
INSERT INTO "user_rooms" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["room_id", 49], ["created_at", "2020-07-31 20:09:58.734088"], ["updated_at", "2020-07-31 20:09:58.734088"]]